import { isWebp, headerFixed } from "./modules";
import createHomeHotelSlider from "./modules/home-hotel-slider";
import Swiper, { Navigation, Pagination, Autoplay, Lazy } from "swiper";
/* Раскомментировать для использования */
// import { MousePRLX } from './libs/parallaxMouse'

/* Раскомментировать для использования */
// import Swiper, { Navigation, Pagination } from 'swiper'

// Проверка браузера на поддерку .webp изображений ====================================================================================================================================================
isWebp();
// ====================================================================================================================================================

// Паралакс мышей ====================================================================================================================================================
// const mousePrlx = new MousePRLX({})
// ====================================================================================================================================================

// Фиксированный header ====================================================================================================================================================
// headerFixed()
// ====================================================================================================================================================
document.addEventListener("DOMContentLoaded", function (evt) {
    createHomeHotelSlider(Swiper);
});
